<?php

namespace Database\Seeders;

use App\Models\Feature;
use App\Models\GalleryItem;
use App\Models\News;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $image = 'swiper-news-1.jpg';
        $items = [
            [
                'title' => 'Підсумки 2018 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2019 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2020 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2021 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2022 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2022 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2023 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2024 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],
            [
                'title' => 'Підсумки 2025 року від компанії «Креатор-Буд»',
                'content' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
                'excerpt' => 'У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ',
            ],

        ];

        News::query()->delete();

        copy(resource_path('frontend/src/assets/img/swiper-news/' . $image), public_path('storage/' . $image));

        foreach ($items as $item) {
            News::create($item + [
                'image' => '/' . $image,
            ]);
        }
    }
}
