<?php

namespace Database\Seeders;

use App\Models\BuildStep;
use App\Models\Feature;
use App\Models\GalleryItem;
use App\Models\Technology;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class TechnologySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $technologiesList = [
            [
                'imgUrl' => 'icon-1.svg',
                'title' => 'Монолітно-каркасна технологія',
                'description' => 'Забезпечує високу міцність і довговічність будівель, а також дозволяє створювати вільні планування без несучих внутрішніх стін. Крім того, вона дає більше гнuchкості в дизайні, краще витримує сейсмічні навантаження та прискорює процес зведення.',
            ],
            [
                'imgUrl' => 'icon-2.svg',
                'title' => 'Утеплення стін - мінеральна вата',
                'description' => 'Утеплення стін мінеральною ватою забезпечує надійну тепло- та звукоізоляцію, зберігаючи комфортний мікроклімат у приміщенні в будь-яку пору року. Матеріал є негорючим, паропроникним і довговічним, що робить його безпечним та ефективним рішенням.',
            ],
            [
                'imgUrl' => 'icon-3.svg',
                'title' => 'Зовнішні, міжквартирні та міжкімнатні стіни - керамоблок',
                'description' => 'Стіни з керамоблоку забезпечують високу міцність будівлі, ефективну тепло- та звукоізоляцію, а також комфортний мікроклімат у приміщеннях. Керамоблок є екологічним матеріалом із хорошою паропроникністю, що сприяє довговічності та енергоефективності будинку.',
            ],
            [
                'imgUrl' => 'icon-4.svg',
                'title' => 'Висота стелі житлової частини: 2,7 - 4,2 метрів',
                'description' => 'Висота стелі  створює відчуття простору та наповнює приміщення світлом і повітрям. Такі пропорції забезпечують комфортне проживання та відкривають більше можливостей для індивідуальних дизайнерських рішень.',
            ],
            [
                'imgUrl' => 'icon-5.svg',
                'title' => 'Паркінг - Підземний з ліфтом',
                'description' => 'Підземний паркінг з ліфтом забезпечує зручний та безпечний доступ до житлових поверхів безпосередньо з рівня паркування. Таке рішення підвищує комфорт мешканців і дозволяє зберегти простір та естетику прибудинкової території.',
            ],
            [
                'imgUrl' => 'icon-6.svg',
                'title' => 'Поверховість ЖК - 5 – 12',
                'description' => 'Поєднує затишок невеликих будинків із сучасними міськими стандартами комфорту. Така висотність дозволяє забезпечити оптимальне освітлення квартир і просторі громадські зони.',
            ],
        ];

        Technology::query()->delete();

        foreach ($technologiesList as $item) {
            $image = $item['imgUrl'];
            copy(resource_path('frontend/src/assets/img/technologies-icon/' . $image), public_path('storage/' . $image));

            Technology::create([
                'image' => '/' . $image,
                'title' => $item['title'],
                'description' => $item['description'],
            ]);
        }
    }
}
