import React from "react";
import { NavLink } from "react-router-dom";
import Facebook from "../assets/svg/facebook.svg?react";
import Twitter from "../assets/svg/twitter.svg?react";
import Instagram from "../assets/svg/instagram.svg?react";
function NewsDetailPage() {
  const newsSwiperList = [
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
    {
      imgUrl: "swiper-news-1.jpg",
      date: "25.12.2025",
      text: "Підсумки 2025 року від компанії «Креатор-Буд»",
      description:
        "У 2025 «Креатор-Буд» активно будував та вводив в експлуатацію нові будинки, створив «Стандарти майбутнього» та тариф електропостачання Free Watt. ",
    },
  ];
  return (
    <>
      <div className="breadcrumbs">
        <div className="container">
          <div className="breadcrumbs__inner">
            <NavLink to="/">
             <img src={new URL(`/src/assets/svg/mini-logo.svg`, import.meta.url).href} />
            </NavLink>
            <NavLink to="/">Новини</NavLink>
            <span>Підсумки 2025 року від компанії «Креатор-Буд»</span>
          </div>
        </div>
      </div>

      <div className="news-detail">
        <div className="container">
          <div className="news-detail__inner">
            <img
              className="news-swiper-item-img"
              src={new URL(`/src/assets/img/head-banner.jpg`, import.meta.url).href}
              alt=""
            />
            <div className="news-detail-info">
              <div className="news-detail-info-social">
                <span>25.12.2025</span>
                <div className="footer-social">
                  <NavLink to="/">
                    <Facebook />
                  </NavLink>
                  <NavLink to="/">
                    <Twitter />
                  </NavLink>
                  <NavLink to="/">
                    <Instagram />
                  </NavLink>
                </div>
              </div>
              <div className="news-detail-info-text">
                <h4>
                  ЖК «Набережна Вежа» – це комплекс бізнес класу, головною
                  перевагою якого є місце розташування. Комплекс зводиться в
                  екологічно чистому районі, поруч Тернопільського ставу.
                </h4>
                <p>
                  У ЖК Dnipro Island почались продажі квартир у нових секціях.
                  На старті продажу ціни найкращі, а вибір квартир найбільший.
                </p>
                <p>
                  В першій секції закінчили кладку зовнішніх і внутрішніх стін.
                  Вікна встановили повністю, ліфти влаштовані на 80%, внутрішні
                  інженерні системи готові на 70%, почали утеплення фасадів.
                </p>

                <p>
                  В другій секції зовнішні і внутрішні стіни теж готові. Вікна
                  встановили повністю, наполовину утеплили фасади, почали
                  влаштування ліфтів.
                </p>

                <p>
                  В третій і четвертій секціях закінчили монолітний каркас,
                  влаштування зовнішніх і внутрішніх стін, вікна встановили
                  наполовину.
                </p>

                <p>
                  В пятій секції закінчили моноліт 8-го поверху, зовнішні стіни
                  готові до 8-го поверху. Внутрішні стіни і перегородки виконані
                  до 7 поверху, сходові марші готові повністю.
                </p>

                <p>
                  В шостій секції моноліт виконаний до 8 поверху, зовнішні стіни
                  готові до 6-го поверху. Також виконали 20% цегляної кладки
                  внутрішніх стін, сходові марші готові повністю.
                </p>

                <p>
                  В секції 2.1 монолітний каркас влаштували до п’ятого поверху.
                  Сходові марші до 4-го. Виконали 20% зовнішніх і внутрішніх
                  стін. В секції 2.2 залили плиту перекриття -1 поверху. В
                  секціях 2.3 і 2.4 на 100% виконали бетонну підготовку.
                </p>

                <p>
                  Зацікавились проєктом? Чекаємо вас у відділі продажу за
                  адресою: вул. Дніпровська Набережна, 16А.
                </p>

                <p>
                  Актуальні акції, новини будівництва та переваги житлових
                  комплексів ви можете дізнатися з нашого каналу в Telegram — за
                  посиланням.
                </p>

                <p>
                  Скористайтеся ботом-помічником у Telegram від «Креатор-Буд»,
                  який може зв’язати вас з відділом продажів у декілька кліків.
                  Також ви можете отримати інформацію про актуальні ціни, акції
                  та новини з будівництва — за посиланням.
                </p>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}

export { NewsDetailPage };
